![Pandas](python-pandas.png)

## Pandas review 1
1. *basic series*
2. *custom indexes*
3. *using identifiers to retreve data*
4. *statistics*
5. *describe*

---

In [34]:
import pandas as pd

In [35]:
# panda series are one - dimension arrays .The axis labels are collectively called index.
numbers = pd.Series([87,100,94,100,98])
print(numbers)
print(type(numbers))

0     87
1    100
2     94
3    100
4     98
dtype: int64
<class 'pandas.core.series.Series'>

In [36]:
numbers2 = pd.Series(10.5,range(11))
numbers2

0     10.5
1     10.5
2     10.5
3     10.5
4     10.5
5     10.5
6     10.5
7     10.5
8     10.5
9     10.5
10    10.5
dtype: float64

In [37]:
#define indexies
fruits = pd.Series(['apple','kiwi','pear','banana'] , index =[ 'A','B','C','D'])
fruits

A     apple
B      kiwi
C      pear
D    banana
dtype: object

In [38]:
print(fruits[2])
print(fruits['C'])
print(fruits.C)

pear
pear
pear

In [39]:
fruits.D ='Dragon Fruit'
fruits

A           apple
B            kiwi
C            pear
D    Dragon Fruit
dtype: object

In [40]:
#create pandas series using dictionary 
people = {'Tom':60,'Mary':55,'Sue':20,'Johnny':13,'Ben':55,'Henry':20}
print(people)

#in pandas keys become indexes automatically
staff = pd.Series(people)
print(staff)

{'Tom': 60, 'Mary': 55, 'Sue': 20, 'Johnny': 13, 'Ben': 55, 'Henry': 20}
Tom       60
Mary      55
Sue       20
Johnny    13
Ben       55
Henry     20
dtype: int64

In [41]:
print(staff.Tom)
staff.Tom = 44
print(staff.Tom)

60
44

In [42]:
print (people)

{'Tom': 60, 'Mary': 55, 'Sue': 20, 'Johnny': 13, 'Ben': 55, 'Henry': 20}

In [43]:
#get all the values from series as an ndarray
ages = staff.values
print(ages)
print(type(ages))
indexes = staff.index
print(indexes)
print(type(staff))

[44 55 20 13 55 20]
<class 'numpy.ndarray'>
Index(['Tom', 'Mary', 'Sue', 'Johnny', 'Ben', 'Henry'], dtype='object')
<class 'pandas.core.series.Series'>

In [44]:
# statistics
# 2 mode values 
print(staff.mean())
print(staff.mode())
print(staff.min())
print(staff.max())
print(staff.count())
print(staff.std())
print(staff.var())

34.5
0    20
1    55
dtype: int64
13
55
6
19.044684297724654
362.7

In [45]:
print(staff.describe())

count     6.000000
mean     34.500000
std      19.044684
min      13.000000
25%      20.000000
50%      32.000000
75%      52.250000
max      55.000000
dtype: float64

In [46]:
# Make a dataframe from 3 series (string, ints, float) and try concat on axis 1 and 0
series1 = pd.Series(["Tom","Paul","Luke"],name="Name")
series2 = pd.Series([34,56,25],name="Age")
series3 = pd.Series([25000,34000,22000],name="Salary",dtype=float)
employees = pd.concat([series1,series2,series3],axis=1)
# Change the df indexes 
employees.index = ["Person1","Person2","Person3"]
print(employees)

         Name  Age   Salary
Person1   Tom   34  25000.0
Person2  Paul   56  34000.0
Person3  Luke   25  22000.0

In [47]:
# Get the value of the cell with 'Paul' in it and show the data type
print(employees.loc['Person2'])
print(employees.loc['Person2'].dtype)
print(employees.at['Person2','Name']),type(employees.at['Person2','Name'])

Name       Paul
Age          56
Salary    34000
Name: Person2, dtype: object
object
Paul

(None, str)

In [48]:
# Get the value if the cell with 34 in it and show the data type
cell34 = employees['Age'] ==34
employees.loc[cell34]

        Name  Age   Salary
Person1  Tom   34  25000.0

In [49]:
# Get the value if the cell with 22000.0 in it and show the data type
print(employees.at['Person3','Salary']),type(employees.at['Person3','Salary'])

22000.0

(None, numpy.float64)

In [50]:
print(employees.Name.Person1)
print(type(employees.Name.Person1))

Tom
<class 'str'>

#### change the value at the specific cell

In [51]:
employees.at['Person3','Name '] = 'Lucas'
#employees.Salary.Person2 =35000 <-----this is the copy so i cannot reasign new value
employees

         Name  Age   Salary  Name
Person1   Tom   34  25000.0    NaN
Person2  Paul   56  34000.0    NaN
Person3  Luke   25  22000.0  Lucas

In [53]:
type(employees.Age)

pandas.core.series.Series

In [54]:
employees.Age.describe()

count     3.000000
mean     38.333333
std      15.947832
min      25.000000
25%      29.500000
50%      34.000000
75%      45.000000
max      56.000000
Name: Age, dtype: float64

In [55]:
employees.loc[:,['Age']].describe()

             Age
count   3.000000
mean   38.333333
std    15.947832
min    25.000000
25%    29.500000
50%    34.000000
75%    45.000000
max    56.000000